---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.RebarCoverType
source: html/3ad33bbc-daa7-28c0-a29a-b7f9d0a57a91.htm
---
# RebarCoverType Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.